_Rarzrabotki/Kazna/DataProcessors/ЗагрузкаСчетовИПлатежекИзЭкселя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСчетовИПлатежекИзЭкселя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/Визы_Состояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Визы_Состояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВизировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженаВКБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплаченоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденСКомментариями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденПоСхеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноСКомментарием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПриходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаРасходованиеДенежныхСредств</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВПути</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ДСКасса</xr:Item>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПроектов</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваФинАгенты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Comment>(Общ) Касса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ПроцентФинАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаФинАгент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФинАгент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПередачи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковФинАгентов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Направления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссииФА</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/ЗаявкаНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СчетаНал</xr:Item>
				<xr:Item>AccumulationRegister.ЛимитыДДС</xr:Item>
				<xr:Item>AccumulationRegister.ЗаявкиНаРасходованиеДС</xr:Item>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
				<xr:Item>AccumulationRegister.СчетаПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплатуПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПревышениеБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПревышенияБюджета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ПроцентФинАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ДатаВозвратаФинАгента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>29</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбменаСБанком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаСБанком</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентРКО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Kazna/DataProcessors/ЗагрузкаСчетовИПлатежекИзЭкселя/Forms/Вариант1/Ext/Form/Module.bsl
&НаСервере
Функция НайтиСправочник(Знач Значение, ИмяСправочника, ДополнительныеПараметры, ДанныеСтроки) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Справочники[ИмяСправочника].ПустаяСсылка();
	КонецЕсли; 
	
	МетаданныеСправочника = Метаданные.Справочники[ИмяСправочника];
	Значение = Лев(СокрЛП(Значение), МетаданныеСправочника.ДлинаНаименования);	
	
	ИмяКэша = "Ссылки" + ИмяСправочника;
	Если ДополнительныеПараметры.Свойство(ИмяКэша) Тогда
		Результат = ДополнительныеПараметры[ИмяКэша][Значение];
		Если ЗначениеЗаполнено(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
	Иначе
		ДополнительныеПараметры.Вставить(ИмяКэша, Новый Соответствие);
	КонецЕсли;
		
	// Ищем по наименованию
	Результат = Справочники[ИмяСправочника].НайтиПоНаименованию(Значение, Истина);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		// Ищем по коду
		Результат = Справочники[ИмяСправочника].НайтиПоКоду(Значение);
		МассивПоиска = Неопределено;
		Если Не ЗначениеЗаполнено(Результат)
			И ДополнительныеПараметры.Свойство("Поиск"+ИмяСправочника, МассивПоиска) Тогда
			// Ищем по произвольным реквизитам
			Для Каждого РеквизитПоиска Из МассивПоиска Цикл
				Результат = Справочники[ИмяСправочника].НайтиПоРеквизиту(РеквизитПоиска.Ключ, Значение);
				Если ЗначениеЗаполнено(Результат) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат)
		И ДополнительныеПараметры.Свойство("Создавать"+ИмяСправочника) Тогда
		ОбъектСправочника = Справочники[ИмяСправочника].СоздатьЭлемент();
		ОбъектСправочника.Наименование = Значение;
		ДополнительныеПараметрыНового = Неопределено;
		Если ДополнительныеПараметры.Свойство("Новые"+ИмяСправочника, ДополнительныеПараметрыНового) Тогда
			Для Каждого Строка Из ДополнительныеПараметрыНового Цикл
				ОбъектСправочника[Строка.Ключ] = ДанныеСтроки[Строка.Значение];
			КонецЦикла; 
		КонецЕсли;
		ОбъектСправочника.Записать();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.КлючДанных = ОбъектСправочника.Ссылка;
		СообщениеПользователю.Текст = "Создан " + ОбъектСправочника.Ссылка;
		СообщениеПользователю.Сообщить();
		Результат = ОбъектСправочника.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ДополнительныеПараметры[ИмяКэша].Вставить(Значение, Результат);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСчетКонтрагента(Значение) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И НЕ БанковскиеСчета.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ"
	);
	Запрос.УстановитьПараметр("Владелец", Значение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьДату(Значение)
	ЧислоМесяц = 1;
	ЧислоДень = 1;
	ЧислоГод = 1;
	ПоложениеТочки = Найти(Значение, ".");
	Если ПоложениеТочки>0 Тогда
		ЧислоМесяц = Число(Сред(Значение, 1, ПоложениеТочки-1));
		Значение = СокрЛП(Сред(Значение, ПоложениеТочки+1));
		ПоложениеТочки = Найти(Значение, ".");
		Если ПоложениеТочки>0 Тогда
			ЧислоДень = Число(Сред(Значение, 1, ПоложениеТочки-1));
			Значение = СокрЛП(Сред(Значение, ПоложениеТочки+1));
			ЧислоГод = Число(Значение);
		КонецЕсли;
	КонецЕсли; 
	Возврат Дата(ЧислоГод, ЧислоМесяц, ЧислоДень);
КонецФункции

&НаСервере
Процедура ЗагрузитьИзТабличногоДокументаВТаблицу(ТаблицаРезультат, ТабДокумент, МассивКолонок, ИмяКлючевогоРеквизита=Неопределено, НачальнаяСтрока, КонечнаяСтрока, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры=Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	ТипСправочников = Справочники.ТипВсеСсылки();
	
	Для ИндексСтроки=НачальнаяСтрока По КонечнаяСтрока Цикл
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		
		Для Каждого Строка Из МассивКолонок Цикл
			
			ЗначениеКолонки = СокрЛП(ТабДокумент.Область(ИндексСтроки, Строка.Значение).Текст);
			ИмяРеквизита = Строка.Ключ;
			Если Не ЗначениеЗаполнено(ЗначениеКолонки)
				И ИмяРеквизита=ИмяКлючевогоРеквизита Тогда
				ТаблицаРезультат.Удалить(НоваяСтрока);
				Возврат;
			КонецЕсли; 
			
			ТипРеквизита = ТипЗнч(НоваяСтрока[Строка.Ключ]);
			Если Не ЗначениеЗаполнено(ЗначениеКолонки) Тогда
				НоваяСтрока[ИмяРеквизита] = Неопределено;
				Если ИмяРеквизита="Контрагент" Тогда
					Если ЗначениеЗаполнено(НоваяСтрока.СуммаБез) Тогда
						НоваяСтрока.Контрагент = КонтрагентБН;
					Иначе
						НоваяСтрока.Контрагент = КонтрагентФ2;
					КонецЕсли; 
				КонецЕсли; 
			ИначеЕсли ТипСправочников.СодержитТип(ТипРеквизита) Тогда
				МетаданныеСправочника = НоваяСтрока[ИмяРеквизита].Метаданные();
				НоваяСтрока[ИмяРеквизита] = НайтиСправочник(ЗначениеКолонки, МетаданныеСправочника.Имя, ДополнительныеПараметры, НоваяСтрока);
			ИначеЕсли ТипРеквизита=Тип("Число") Тогда
				ЗначениеКолонки = СтрЗаменить(ЗначениеКолонки, ",", ".");
				ЗначениеКолонки = СтрЗаменить(ЗначениеКолонки, " ", "");
				НоваяСтрока[ИмяРеквизита] = Число(ЗначениеКолонки);
			ИначеЕсли ТипРеквизита=Тип("Дата") Тогда
				ЗначениеКолонки = СтрЗаменить(ЗначениеКолонки, "/", ".");
				НоваяСтрока[ИмяРеквизита] = ПолучитьДату(ЗначениеКолонки);
			ИначеЕсли ТипРеквизита=Тип("Строка") Тогда
				НоваяСтрока[ИмяРеквизита] = ЗначениеКолонки;
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументНаСервере(Адресс, Расширение) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	Данные = ПолучитьИзВременногоХранилища(Адресс);
	Данные.Записать(ИмяВременногоФайла);
	ТабДокумент.Прочитать(ИмяВременногоФайла);
	КонечнаяСтрока = 3;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументПродолжение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат=Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ВыбранноеИмяФайла);
	ЗагрузитьДокументНаСервере(Адрес, Файл.Расширение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокумент(Команда)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьДокументПродолжение", ЭтотОбъект)
		,,,Истина);
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзТабличногоДокументаВТаблицуРезультата()
	
	ТаблицаРезультат.Очистить();	
	
	СоответствиеКолонок = Новый Структура;
	// Измерения
	СоответствиеКолонок.Вставить("Подразделение", 2);
	// Простые типы
	СоответствиеКолонок.Вставить("СуммаНал", 12);
	СоответствиеКолонок.Вставить("СуммаБез", 11);
	СоответствиеКолонок.Вставить("Задача", 4);
	СоответствиеКолонок.Вставить("Комментарий", 15);
	СоответствиеКолонок.Вставить("КодЕДРПОУ", 7);
	СоответствиеКолонок.Вставить("НаименованиеКонтрагента", 6);
	СоответствиеКолонок.Вставить("НазначениеПлатежа", 14);
	СоответствиеКолонок.Вставить("Дата", 17);
	СоответствиеКолонок.Вставить("РасчетныйСчет", 8);
	// Ссылочные типы
	СоответствиеКолонок.Вставить("СтатьяДвиженияДенежныхСредств", 3);
	СоответствиеКолонок.Вставить("СтатьяЗатрат", 5);
	СоответствиеКолонок.Вставить("Контрагент", 7);
	СоответствиеКолонок.Вставить("Банк", 10);
	СоответствиеКолонок.Вставить("СчетКонтрагента", 8);
	
	ПоискКонтрагенты = Новый Структура;
	ПоискКонтрагенты.Вставить("ЕГРПОУ");
	
	ПоискСчета = Новый Структура;
	ПоискСчета.Вставить("НомерСчета");	
	
	НовыеКонтрагенты = Новый Структура;
	НовыеКонтрагенты.Вставить("Наименование", "НаименованиеКонтрагента");
	НовыеКонтрагенты.Вставить("ЕГРПОУ", "КодЕДРПОУ");
	
	НовыеБанковскиеСчета = Новый Структура;
	НовыеБанковскиеСчета.Вставить("Владелец", "Контрагент");
	НовыеБанковскиеСчета.Вставить("Банк", "Банк");
	НовыеБанковскиеСчета.Вставить("НомерСчета", "РасчетныйСчет");
	
	СсылкиПодразделения = Новый Соответствие;
	СсылкиПодразделения.Вставить("земля", Справочники.Подразделения.НайтиПоКоду("00-000005"));
	СсылкиПодразделения.Вставить("Продажі", Справочники.Подразделения.НайтиПоКоду("00-000007"));
	СсылкиПодразделения.Вставить("Будівництво", Справочники.Подразделения.НайтиПоКоду("00-000002"));
	СсылкиПодразделения.Вставить("СЗ", Справочники.Подразделения.НайтиПоКоду("00-000013"));
	СсылкиПодразделения.Вставить("Адмін", Справочники.Подразделения.НайтиПоКоду("00-000012"));
	СсылкиПодразделения.Вставить("Масани", Справочники.Подразделения.НайтиПоКоду("00-000001"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СоздаватьБанки", Истина);
	ДополнительныеПараметры.Вставить("СоздаватьКонтрагенты", Истина);
	ДополнительныеПараметры.Вставить("СоздаватьСтатьиДвиженияДенежныхСредств", Истина);
	ДополнительныеПараметры.Вставить("СоздаватьБанковскиеСчета", Истина);
	ДополнительныеПараметры.Вставить("ПоискКонтрагенты", ПоискКонтрагенты);
	ДополнительныеПараметры.Вставить("ПоискБанковскиеСчета", ПоискСчета);
	ДополнительныеПараметры.Вставить("СсылкиПодразделения", СсылкиПодразделения);
	ДополнительныеПараметры.Вставить("НовыеБанковскиеСчета", НовыеБанковскиеСчета);
	ДополнительныеПараметры.Вставить("НовыеКонтрагенты", НовыеКонтрагенты);
	
	ТаблицаРезультат.Очистить();
	
	ЗагрузитьИзТабличногоДокументаВТаблицу(ТаблицаРезультат, ТабДокумент,
		СоответствиеКолонок, "Подразделение",
		НачальнаяСтрока, 10000,
		ДополнительныеПараметры);
				
КонецПроцедуры
	
&НаСервере
Процедура НайтиСоздатьДокументыСчетов()
	
	ЗапросПоиска = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетНаОплатуПоставщика.Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	|ГДЕ
	|	СчетНаОплатуПоставщика.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И СчетНаОплатуПоставщика.Контрагент = &Контрагент
	|	И СчетНаОплатуПоставщика.СуммаДокумента = &СуммаДокумента"
	);
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		
		ОбъектДокумента = Неопределено;
		СуммаДокумента = Строка.СуммаБез;
		ВидОплаты = Перечисления.ВидыДенежныхСредств.Безналичные;
		Контрагент = Строка.Контрагент;
		Если Не ЗначениеЗаполнено(СуммаДокумента) Тогда
			СуммаДокумента = Строка.СуммаНал;
			ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Ссылка) Тогда
			ЗапросПоиска.УстановитьПараметр("ДатаНачала", НачалоДня(Строка.Дата));
			ЗапросПоиска.УстановитьПараметр("ДатаКонца", КонецДня(Строка.Дата));
			ЗапросПоиска.УстановитьПараметр("Контрагент", Контрагент);
			ЗапросПоиска.УстановитьПараметр("СуммаДокумента", СуммаДокумента);
			Выборка = ЗапросПоиска.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				ОбъектДокумента = Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
			КонецЕсли; 
		Иначе
			ОбъектДокумента = Строка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если ОбъектДокумента.ПометкаУдаления Тогда
			ОбъектДокумента.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;		
		
		ЗаполнитьЗначенияСвойств(ОбъектДокумента, Строка);
		ОбъектДокумента.ВидОплаты = ВидОплаты;
		ОбъектДокумента.Организация = Организация;
		Если ВидОплаты=Перечисления.ВидыДенежныхСредств.Наличные Тогда
			ОбъектДокумента.Организация = ОрганизацияНал;
		КонецЕсли;
		ОбъектДокумента.СуммаДокумента = СуммаДокумента;
		ОбъектДокумента.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ОбъектДокумента.Автор = ПараметрыСеанса.ТекущийПользователь;
		ОбъектДокумента.Виза_Состояние = Перечисления.Визы_Состояния.Черновик;
		ОбъектДокумента.ПлановаяДатаОплаты = ОбъектДокумента.Дата;
		
		Если Не ЗначениеЗаполнено(ОбъектДокумента.СтатьяДвиженияДенежныхСредств) Тогда
			ОбъектДокумента.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		КонецЕсли; 
		
		ЭтоБылНовый = ОбъектДокумента.ЭтоНовый();		
				
		ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
		Если ЭтоБылНовый Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.КлючДанных = ОбъектДокумента.Ссылка;
			СообщениеПользователю.Текст = "Создан " + ОбъектДокумента.Ссылка;
			СообщениеПользователю.Сообщить();
		КонецЕсли; 
		Строка.Ссылка = ОбъектДокумента.Ссылка;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуСТабличногоДокумента(Команда)
	
	ЗагрузитьИзТабличногоДокументаВТаблицуРезультата();
	Элементы.Шапка.ТекущаяСтраница = Элементы.Счета;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	НайтиСоздатьДокументыСчетов();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОплатыНаСервере()
	
	ТаблицаОплат.Очистить();	
	
	СоответствиеКолонок = Новый Структура;
	// Измерения
	СоответствиеКолонок.Вставить("Подразделение", 1);
	// Простые типы
	СоответствиеКолонок.Вставить("Дата", 7);
	СоответствиеКолонок.Вставить("СуммаБез", 8);
	СоответствиеКолонок.Вставить("СуммаНал", 9);
	СоответствиеКолонок.Вставить("Комментарий", 11);
	СоответствиеКолонок.Вставить("Задача", 3);
	СоответствиеКолонок.Вставить("НаименованиеКонтрагента", 5);
	СоответствиеКолонок.Вставить("КодЕДРПОУ", 6);
	// Ссылочные типы
	СоответствиеКолонок.Вставить("СтатьяДвиженияДенежныхСредств", 2);
	СоответствиеКолонок.Вставить("СтатьяЗатрат", 4);
	СоответствиеКолонок.Вставить("Контрагент", 6);
	
	ПоискКонтрагенты = Новый Структура;
	ПоискКонтрагенты.Вставить("ЕГРПОУ");
	
	НовыеКонтрагенты = Новый Структура;
	НовыеКонтрагенты.Вставить("Наименование", "НаименованиеКонтрагента");
	НовыеКонтрагенты.Вставить("ЕГРПОУ", "КодЕДРПОУ");
	
	НовыеБанковскиеСчета = Новый Структура;
	НовыеБанковскиеСчета.Вставить("Владелец", "Контрагент");
	НовыеБанковскиеСчета.Вставить("Банк", "Банк");
	
	СсылкиПодразделения = Новый Соответствие;
	СсылкиПодразделения.Вставить("земля", Справочники.Подразделения.НайтиПоКоду("00-000005"));
	СсылкиПодразделения.Вставить("Продажі", Справочники.Подразделения.НайтиПоКоду("00-000007"));
	СсылкиПодразделения.Вставить("Будівництво", Справочники.Подразделения.НайтиПоКоду("00-000002"));
	СсылкиПодразделения.Вставить("СЗ", Справочники.Подразделения.НайтиПоКоду("00-000013"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СоздаватьКонтрагенты", Истина);
	ДополнительныеПараметры.Вставить("СоздаватьСтатьиДвиженияДенежныхСредств", Истина);
	ДополнительныеПараметры.Вставить("СоздаватьСтатьиЗатрат", Истина);
	ДополнительныеПараметры.Вставить("ПоискКонтрагенты", ПоискКонтрагенты);
	ДополнительныеПараметры.Вставить("СсылкиПодразделения", СсылкиПодразделения);
	ДополнительныеПараметры.Вставить("НовыеБанковскиеСчета", НовыеБанковскиеСчета);
	ДополнительныеПараметры.Вставить("НовыеКонтрагенты", НовыеКонтрагенты);
	
	ЗагрузитьИзТабличногоДокументаВТаблицу(ТаблицаОплат, ТабДокумент,
		СоответствиеКолонок, ,
		5, 500,
		ДополнительныеПараметры);	
		
	МассивСтрок = Новый Массив;
	Для Каждого Строка Из ТаблицаОплат Цикл
		Если (Не ЗначениеЗаполнено(Строка.Дата) ИЛИ (ЗначениеЗаполнено(ДатаСчетов) И Строка.Дата<ДатаСчетов))
			ИЛИ (Не ЗначениеЗаполнено(Строка.СуммаНал) И Не ЗначениеЗаполнено(Строка.СуммаБез)) Тогда
			МассивСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла; 
	Для Каждого Строка Из МассивСтрок Цикл
		ТаблицаОплат.Удалить(Строка);
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОплаты(Команда)
	ЗагрузитьОплатыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыОплатНаСервере()
		
	Для Каждого Строка Из ТаблицаОплат Цикл
		
		ОбъектДокумента = Неопределено;
		СуммаДокумента = Строка.СуммаБез;
		ТипДокумента = "ПлатежноеПоручениеВходящее";
		Контрагент = Строка.Контрагент;
		
		Если Не ЗначениеЗаполнено(СуммаДокумента) Тогда
			СуммаДокумента = Строка.СуммаНал;
			ТипДокумента = "ПриходныйКассовыйОрдер";
			Если СуммаДокумента<0 Тогда
				ТипДокумента = "РасходныйКассовыйОрдер";
				СуммаДокумента = -СуммаДокумента;
			КонецЕсли;
		Иначе
			Если СуммаДокумента<0 Тогда
				ТипДокумента = "ПлатежноеПоручениеИсходящее";
				СуммаДокумента = -СуммаДокумента;
			КонецЕсли;			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Ссылка) Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Док.Ссылка
			|ИЗ
			|	Документ.ПриходныйКассовыйОрдер КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
			|	И Док.Контрагент = &Контрагент
			|	И Док.СуммаДокумента = &СуммаДокумента";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПриходныйКассовыйОрдер", ТипДокумента);
			ЗапросПоиска = Новый Запрос(ТекстЗапроса);
			ЗапросПоиска.УстановитьПараметр("ДатаНачала", НачалоДня(Строка.Дата));
			ЗапросПоиска.УстановитьПараметр("ДатаКонца", КонецДня(Строка.Дата));
			ЗапросПоиска.УстановитьПараметр("Контрагент", Контрагент);
			ЗапросПоиска.УстановитьПараметр("СуммаДокумента", СуммаДокумента);
			Выборка = ЗапросПоиска.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				ОбъектДокумента = Документы[ТипДокумента].СоздатьДокумент();
			КонецЕсли; 
		Иначе
			ОбъектДокумента = Строка.Ссылка.ПолучитьОбъект();
		КонецЕсли; 
		
		Если ОбъектДокумента.ПометкаУдаления Тогда
			ОбъектДокумента.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;		
		
		ЗаполнитьЗначенияСвойств(ОбъектДокумента, Строка);
		ОбъектДокумента.Организация = ОрганизацияНал;
		Если ТипДокумента="ПлатежноеПоручениеВходящее"
			ИЛИ ТипДокумента="ПлатежноеПоручениеИсходящее" Тогда
			ОбъектДокумента.Организация = Организация;
		КонецЕсли; 
		ОбъектДокумента.СуммаДокумента = СуммаДокумента;
		ОбъектДокумента.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		МетаданныеДокумента = ОбъектДокумента.Метаданные();
		
		Если Не ЗначениеЗаполнено(ОбъектДокумента.СтатьяДвиженияДенежныхСредств) Тогда
			ОбъектДокумента.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		КонецЕсли; 
		
		Если МетаданныеДокумента.Реквизиты.Найти("СчетОрганизации")<>Неопределено
			И Не ЗначениеЗаполнено(ОбъектДокумента.СчетОрганизации) Тогда
			ОбъектДокумента.СчетОрганизации = ОбъектДокумента.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Касса")<>Неопределено
			И Не ЗначениеЗаполнено(ОбъектДокумента.Касса) Тогда
			ОбъектДокумента.Касса = ОбъектДокумента.Организация.ОсновнаяКасса;
		КонецЕсли;		
				
		ЭтоБылНовый = ОбъектДокумента.ЭтоНовый();
				
		ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
		Если ЭтоБылНовый Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.КлючДанных = ОбъектДокумента.Ссылка;
			СообщениеПользователю.Текст = "Создан " + ОбъектДокумента.Ссылка;
			СообщениеПользователю.Сообщить();
		КонецЕсли;		
		Строка.Ссылка = ОбъектДокумента.Ссылка;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыОплат(Команда)
	СоздатьДокументыОплатНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиЗаявку(ДокументОплаты)
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	//|ИЗ
	//|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	//|ГДЕ
	//|	ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование = &ДокументОснование"
	//);
	//Запрос.УстановитьПараметр("ДокументОснование", ДокументОплаты);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Возврат Выборка.Ссылка;
	//КонецЕсли;
	
	Возврат ДокументОплаты.ДокументОснование;
	
КонецФункции

&НаСервере
Функция НайтиСчетНаОплатуПоставщика(ДокументОплаты)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И Док.Контрагент=&Контрагент
	|	И Док.СуммаДокумента=&СуммаДокумента
	|	И Док.ВидОплаты=&ВидОплаты"
	//|	И Док.Подразделение=&Подразделение"
	);
	Запрос.УстановитьПараметр("ДатаНачала", ДокументОплаты.Дата-24*60*60*3);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДокументОплаты.Дата));
	Запрос.УстановитьПараметр("Контрагент", ДокументОплаты.Контрагент);
	Запрос.УстановитьПараметр("СуммаДокумента", ДокументОплаты.СуммаДокумента);
	Запрос.УстановитьПараметр("ВидОплаты", ?(ТипЗнч(ДокументОплаты)=Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее"), Перечисления.ВидыДенежныхСредств.Безналичные, Перечисления.ВидыДенежныхСредств.Наличные));
	//Запрос.УстановитьПараметр("Подразделение", ДокументОплаты.Подразделение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура СоздатьДокументыЗаявкиНаСервере()
	
	МассивДокументов = Новый Массив;
	// Найдем заявки
	Для Каждого Строка Из ТаблицаОплат Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Ссылка) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(Строка.Ссылка)=Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
			ИЛИ ТипЗнч(Строка.Ссылка)=Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Строка.Заявка) Тогда
			Строка.Заявка = НайтиЗаявку(Строка.Ссылка);
		КонецЕсли;
		
		НовыйОбъект = Неопределено;
		Если Не ЗначениеЗаполнено(Строка.Заявка) Тогда
			НовыйОбъект = Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
		Иначе
			НовыйОбъект = Строка.Заявка.ПолучитьОбъект();
		КонецЕсли;
		
		Если НовыйОбъект.ПометкаУдаления Тогда
			НовыйОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;		
		
		ЗаполнитьЗначенияСвойств(НовыйОбъект, Строка.Ссылка,, "Номер, Ссылка");
		НовыйОбъект.ДокументОснование = Неопределено;
		НовыйОбъект.СчетНаОплатуПоставщика = НайтиСчетНаОплатуПоставщика(Строка.Ссылка);
		НовыйОбъект.ВидОплаты = Перечисления.ВидыДенежныхСредств.Безналичные;
		НовыйОбъект.Организация = Организация;
		Если ТипЗнч(Строка.Ссылка)=Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
			НовыйОбъект.ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные;
			НовыйОбъект.Организация = ОрганизацияНал;
		КонецЕсли;
		ЭтоБылНовый = НовыйОбъект.ЭтоНовый();
				
		НовыйОбъект.Записать();
		Если ЭтоБылНовый Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.КлючДанных = НовыйОбъект.Ссылка;
			СообщениеПользователю.Текст = "Создан " + НовыйОбъект.Ссылка;
			СообщениеПользователю.Сообщить();
		КонецЕсли; 
		
		МетаданныеСсылки = Строка.Ссылка.Метаданные();
		Если МетаданныеСсылки.Реквизиты.Найти("ДокументОснование")<>Неопределено Тогда
			ОбъектСсылки = Строка.Ссылка.ПолучитьОбъект();
			ОбъектСсылки.ДокументОснование = НовыйОбъект.Ссылка;
			ОбъектСсылки.Записать();
		КонецЕсли; 
		
		Строка.Заявка = НовыйОбъект.Ссылка;
		Строка.ЗаявкаВсеНашла = ЗначениеЗаполнено(Строка.Заявка.СчетНаОплатуПоставщика);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыЗаявки(Команда)
	СоздатьДокументыЗаявкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаДокумента = Документы.ПлатежноеПоручениеИсходящее.НайтиПоНомеру("ED00-0426");
	НайденныйСчет = НайтиСчетНаОплатуПоставщика(СсылкаДокумента);
КонецПроцедуры

&НаСервере
Процедура УдалитьПомеченныеСчетаИзЗаявокНаСервере()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	НЕ ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления
	|	И ЗаявкаНаРасходованиеДенежныхСредств.СчетНаОплатуПоставщика.ПометкаУдаления"
	);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектЗаявки = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаявки.СчетНаОплатуПоставщика = Неопределено;
		ОбъектЗаявки.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	НЕ ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления
	|	И ЗаявкаНаРасходованиеДенежныхСредств.СчетНаОплатуПоставщика.ПометкаУдаления"
	);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектЗаявки = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаявки.СчетНаОплатуПоставщика = Неопределено;
		ОбъектЗаявки.Записать();
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПомеченныеСчетаИзЗаявок(Команда)
	УдалитьПомеченныеСчетаИзЗаявокНаСервере();
КонецПроцедуры
